Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
 vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

  # module.eks.aws_security_group.eks_node_group will be created
+ resource "aws_security_group" "eks_node_group" {
      + arn                    = (known after apply)
      + description            = "Security group for node group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-tmcdapne2-nhwy-ng"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                                 = "eks-tmcdapne2-nhwy-ng"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + tags_all               = {
          + "Name"                                 = "eks-tmcdapne2-nhwy-ng"
          + "account"                              = "id"
          + "aws_region"                           = "ap-northeast-2"
          + "kubernetes.io/cluster/tmcdapne2-nhwy" = "owned"
          + "product"                              = "tmc"
          + "shard_id"                             = "tmcdapne2"
        }
      + vpc_id                 = "vpc-02bd27f3ad9337b18"
    }

  # module.eks.aws_sqs_queue.aws_node_termination_handler_queue will be created
+ resource "aws_sqs_queue" "aws_node_termination_handler_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 43200
      + name                              = "tmcdapne2-nhwy-aws-node-termination-handler-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = true
      + tags                              = {
          + "Name"       = "tmcdapne2-nhwy-aws-node-termination-handler-queue"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + tags_all                          = {
          + "Name"       = "tmcdapne2-nhwy-aws-node-termination-handler-queue"
          + "account"    = "id"
          + "aws_region" = "ap-northeast-2"
          + "product"    = "tmc"
          + "shard_id"   = "tmcdapne2"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.eks.aws_sqs_queue_policy.aws_node_termination_handler_queue will be created
+ resource "aws_sqs_queue_policy" "aws_node_termination_handler_queue" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

Plan: 57 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ aws_iam_openid_connect_provider_arn       = (known after apply)
+ aws_iam_openid_connect_provider_url       = (known after apply)
+ aws_security_group_eks_cluster_default_id = (known after apply)
+ aws_security_group_eks_cluster_id         = (known after apply)
+ aws_security_group_eks_node_group_id      = (known after apply)

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p eks/tmcd_apnortheast2/tmcdapne2-nhwy`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Feks%252Ftmcd_apnortheast2%252Ftmcdapne2-nhwy%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p eks/tmcd_apnortheast2/tmcdapne2-nhwy`
</details>
Plan: 57 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
